In [61]:
import pandas as pd
import numpy as np
from collections import Counter

In [62]:
tesla_stock_price = "tesla_stock_price.csv"
elonmusk_tweets = "elonmusk_tweets.csv"

In [63]:
tesla_stock_price_data = pd.read_csv(tesla_stock_price)
elonmusk_tweets = pd.read_csv(elonmusk_tweets)

tesla_stock_price_data.head()

        Date       Open   High        Low      Close    Volume  Adj Close
0  6/29/2010  19.000000  25.00  17.540001  23.889999  18766300  23.889999
1  6/30/2010  25.790001  30.42  23.299999  23.830000  17187100  23.830000
2   7/1/2010  25.000000  25.92  20.270000  21.959999   8218800  21.959999
3   7/2/2010  23.000000  23.10  18.709999  19.200001   5139800  19.200001
4   7/6/2010  20.000000  20.00  15.830000  16.110001   6866900  16.110001

In [64]:
new_stock_data = tesla_stock_price_data[['Date','Open','Close']]
new_stock_data.head()

        Date       Open      Close
0  6/29/2010  19.000000  23.889999
1  6/30/2010  25.790001  23.830000
2   7/1/2010  25.000000  21.959999
3   7/2/2010  23.000000  19.200001
4   7/6/2010  20.000000  16.110001

In [65]:
daily_change = round(tesla_stock_price_data["Close"]-tesla_stock_price_data["Open"],2)
daily_change.head()

0    4.89
1   -1.96
2   -3.04
3   -3.80
4   -3.89
dtype: float64

In [66]:
daily_percent_change = round((tesla_stock_price_data["Close"]-tesla_stock_price_data["Open"])/tesla_stock_price_data["Open"],2)
daily_percent_change.head()

0    0.26
1   -0.08
2   -0.12
3   -0.17
4   -0.19
dtype: float64

In [67]:
update_stock_data = pd.DataFrame({
    "date": tesla_stock_price_data.Date,
    "open": tesla_stock_price_data.Open,
    "close": tesla_stock_price_data.Close,
    "daily change": daily_change,
    "percentage change": daily_percent_change
})
update_stock_data.head()

        date       open      close  daily change  percentage change
0  6/29/2010  19.000000  23.889999          4.89               0.26
1  6/30/2010  25.790001  23.830000         -1.96              -0.08
2   7/1/2010  25.000000  21.959999         -3.04              -0.12
3   7/2/2010  23.000000  19.200001         -3.80              -0.17
4   7/6/2010  20.000000  16.110001         -3.89              -0.19

In [68]:
elonmusk_tweets.head()

  created_at                                               text
0   4/5/2017  b'And so the robots spared humanity ... https:...
1   4/3/2017  b"@ForIn2020 @waltmossberg @mims @defcon_5 Exa...
2   4/3/2017      b'@waltmossberg @mims @defcon_5 Et tu, Walt?'
3   4/3/2017                b'Stormy weather in Shortville ...'
4   4/2/2017  b"@DaveLeeBBC @verge Coal is dying due to nat ...

In [83]:
daily_tweet_counts=elonmusk_tweets.groupby(['created_at']).count()
daily_tweet_counts.head()

            text
created_at
1/1/2012       7
1/1/2015       1
1/1/2016       1
1/10/2013      2
1/10/2015     13

In [86]:
tweet_count = pd.DataFrame({
    "Tweet Date": daily_tweet_counts.index,
    "Tweet Count": daily_tweet_counts.text})
tweet_count.head()

           Tweet Date  Tweet Count
created_at
1/1/2012     1/1/2012            7
1/1/2015     1/1/2015            1
1/1/2016     1/1/2016            1
1/10/2013   1/10/2013            2
1/10/2015   1/10/2015           13

In [101]:
merged_df = pd.merge(update_stock_data, tweet_count, how="left",left_on="date",right_on="Tweet Date")
merged_df.head()

,date,open,close,daily change,percentage change,Tweet Date,Tweet Count
0,6/29/2010,19.000000,23.889999,4.89,0.26,NaN,NaN
1,6/30/2010,25.790001,23.830000,-1.96,-0.08,NaN,NaN
2,7/1/2010,25.000000,21.959999,-3.04,-0.12,NaN,NaN
3,7/2/2010,23.000000,19.200001,-3.80,-0.17,NaN,NaN
4,7/6/2010,20.000000,16.110001,-3.89,-0.19,NaN,NaN

In [94]:
update_stock_data.columns

Index(['date', 'open', 'close', 'daily change', 'percentage change'], dtype='object')